import "./reminder.css";
import { useState } from "react";

export default function Reminder() {
    const reminders = [
  "الحمد لله رب العالمين",
  "الحمد لله دائمًا وأبدًا",
  "سبحان الله وبحمده",
  "سبحان الله العظيم",
  "سبحان الله والحمد لله ولا إله إلا الله والله أكبر",
  "لا إله إلا الله",
  "الله أكبر",
  "لا حول ولا قوة إلا بالله",
  "أستغفر الله وأتوب إليه",
  "رب اغفر لي وتب علي إنك أنت التواب الرحيم",
  "اللهم صل وسلم وبارك على نبينا محمد ﷺ",
  "اللهم صل على محمد وعلى آل محمد ﷺ",
  "اللهم أعنا على ذكرك وشكرك وحسن عبادتك",
  "رضيت بالله ربًا، وبالإسلام دينًا، وبمحمد ﷺ نبيًا",
  "يا حي يا قيوم برحمتك أستغيث",
  "حسبي الله ونعم الوكيل",
  "توكلت على الله",
  "اللهم اجعلني من الذاكرين الشاكرين",
  "اللهم لك الحمد كما ينبغي لجلال وجهك وعظيم سلطانك",
  "رب اشرح لي صدري ويسر لي أمري",
];
const [randomReminder] = useState(
  () => reminders[Math.floor(Math.random() * reminders.length)]
);
  return (
    <div className="reminder-div">
      <p className="reminder-text">{randomReminder}</p>
    </div>
  );
}
